// (0,0)*(0,0) + (0,1)*(1,0) =>(0,0) //32 //22
// (0,0)*(0,1) + (0,1)*(1,1) =>(0,1)
// (1,0)*(0,0) + (1,1)*(1,0) =>(1,0)
// (1,0)*(0,1) + (1,1)*(1,1) => (1,1)
// (2,0)*(0,0) + (2,1)*(1,0) =>(2,0)
// (2,0)*(1,0) + (2,1)*(1,1) => (2,1)

// 행렬의 곱셈 계산은 앞열의 행 * 뒷배열의 열을 더한것
// 곱셈이 되려면 앞배열의 행 = 뒷배열의 열
class Solution {
    public int[][] solution(int[][] arr1, int[][] arr2) {
        int[][] answer = new int[arr1.length][arr2[0].length];
        
        for(int i=0; i<arr1.length; ++i) {
            for (int j=0; j<arr2[0].length; ++j) {
                for (int k=0; k<arr1[0].length; ++k) {
                    answer[i][j]+=arr1[i][k]*arr2[k][j];
                    // (2,0)*(0,0) + (2,1)*(1,0) =>(2,0)
                }
            }
        }
        return answer;
    }
}